Repository: kodi-pvr/pvr.iptvsimple
Catalog: pvr.iptvsimple/resources/language/resource.language.*/strings.po
Languages: pt_br, zh_tw

# Addon Summary
source: Kodi PVR addon for IPTV support.
pt_br: Addon de PVR no Kodi com suporte a IPTV. https://github.com/afedchin/Kodi-addon-iptvsimple/wiki/IPTV-Simple-Home

# Addon Description
source: IPTV Simple PVR Client support m3u playlists, streaming of Live TV for multicast/unicast sources, listening to Radio channels and EPG.[CR] [CR]For documentation visit: https://github.com/kodi-pvr/pvr.iptvsimple/blob/Matrix/README.md[CR]
pt_br: O IPTV Simple PVR Client oferece suporte para listas m3u, transmissão de TV ao vivo de fontes multicast/unicast, transmissão de rádios e, ainda, suporta o guia eletrônico de programação - EPG.

# Addon Disclaimer
source: The authors are in no way responsible for failed playings, incorrect EPG times, wasted hours, or any other undesirable effects.
pt_br: Este é um software instável! Os autores não são responsáveis por falhas nas reproduções, horários incorretos no EPG, horas perdidas ou quaisquer outros efeitos indesejáveis.

# #30000
source: Location
pt_br: Local
zh_tw: 位置

# #30001
source: Local path (includes local network)
pt_br: Caminho local (inclui a rede local)

# #30002
source: Remote path (Internet address)
pt_br: Caminho remoto (endereço internet)

# #30003
source: Disabled
pt_br: Desativado

# #30004
source: Repeated refresh
pt_br: Atualização repetida

# #30005
source: Once per day
pt_br: Uma vez por dia

# #30006
source: Providers
pt_br: Provedores

# #30007
source: Default provider name
pt_br: Nome do provedor padrão

# #30008
source: Enable provider mapping
pt_br: Ativar mapeamento de provedor

# #30009
source: Provider name mapping file
pt_br: Arquivo de mapeamento do nome do provedor

# #30010
source: General
pt_br: Geral
zh_tw: 一般設定

# #30011
source: M3U playlist path
pt_br: Caminho da lista de reprodução M3U

# #30012
source: M3U playlist URL
pt_br: URL da lista de reprodução M3U

# #30013
source: Start channel number
pt_br: Número do canal inicial

# #30014
source: Only number by channel order in M3U
pt_br: Somente número por ordem de canal no M3U

# #30015
source: Auto refresh mode
pt_br: Modo de atualização automática

# #30016
source: Refresh interval
pt_br: Intervalo de atualização

# #30017
source: Refresh hour (24h)
pt_br: Hora de atualização (24h)

# #30018
source: Refresh
pt_br: Atualizar

# #30019
source: EPG Settings
pt_br: Configurações de EPG

# #30021
source: XMLTV path
pt_br: Caminho XMLTV

# #30022
source: XMLTV URL
pt_br: URL para XMLTV
zh_tw: XMLTV 網址

# #30023
source: Apply time shift to all channels
pt_br: Aplicar mudança de horário em todos os canais

# #30024
source: EPG time shift
pt_br: Mudança de horário EPG

# #30025
source: Cache m3u at local storage
pt_br: Armazenar m3u em cache localmente
zh_tw: 儲存 m3u 到快取記憶體

# #30026
source: Cache XMLTV at local storage
pt_br: Armazenar XMLTV em cache localmente
zh_tw: 儲存 XMLTV 到快取記憶體

# #30027
source: {0:.1f} hours
pt_br: {0:.1f} horas

# #30028
source: Only load TV channels in groups
pt_br: Carregar apenas canais de TV em grupos

# #30029
source: TV Groups
pt_br: Grupos de TV

# #30030
source: Channel Logos
pt_br: Logos dos Canais

# #30031
source: Channel logos folder
pt_br: Pasta com os logos do canais

# #30032
source: Channel logos base URL
pt_br: URL base dos logotipos do canal

# #30033
source: Radio Groups
pt_br: Grupos de rádio

# #30034
source: TV group mode
pt_br: Modo de grupo de TV

# #30035
source: Radio group mode
pt_br: Modo de grupo de rádio

# #30036
source: All groups
pt_br: Todos os grupos

# #30037
source: Some groups
pt_br: Alguns grupos

# #30038
source: Custom groups
pt_br: Grupos personalizados

# #30039
source: Number of TV groups
pt_br: Número de grupos de TV

# #30040
source: XMLTV Logos Options
pt_br: Opções de Logos XMLTV
zh_tw: XMLTV 台標選項

# #30041
source: Channels logos from XMLTV
pt_br: Logos de canais do XMLTV

# #30042
source: Ignore
pt_br: Ignorar
zh_tw: 忽略

# #30043
source: Prefer M3U
pt_br: Preferir M3U
zh_tw: 首選的 M3U 檔

# #30044
source: Prefer XMLTV
pt_br: Preferir XMLTV
zh_tw: 首選的 XMLTV 檔

# #30045
source: TV group 1
pt_br: Grupo 1 de TV

# #30046
source: TV group 2
pt_br: Grupo 2 de TV

# #30047
source: TV group 3
pt_br: Grupo 3 de TV

# #30048
source: TV group 4
pt_br: Grupo 4 de TV

# #30049
source: TV group 5
pt_br: Grupo 5 de TV

# #30050
source: Genres
pt_br: Gêneros

# #30051
source: Use genre text from XMLTV when mapping genres
pt_br: Use texto de gênero do XMLTV ao mapear gêneros

# #30052
source: Genres path
pt_br: Caminho Gêneros

# #30053
source: Genres URL
pt_br: URL Gêneros

# #30054
source: Custom TV groups file
pt_br: Arquivo de grupos de TV personalizados

# #30055
source: Radio group 1
pt_br: Grupo 1 de rádio

# #30056
source: Radio group 2
pt_br: Grupo 2 de rádio

# #30057
source: Radio group 3
pt_br: Grupo 3 de rádio

# #30058
source: Radio group 4
pt_br: Grupo 4 de rádio

# #30059
source: Radio group 5
pt_br: Grupo 5 de rádio

# #30060
source: Advanced
pt_br: Avançado

# #30061
source: Multicast relay (udpxy)
pt_br: Relé de difusão seletiva (udpxy)

# #30062
source: Transform multicast stream URLs
pt_br: Transformar URLs de fluxo multicast

# #30063
source: Relay hostname or IP address
pt_br: Nome do host ou endereço IP de retransmissão

# #30064
source: Relay port
pt_br: Porta de relé

# #30065
source: Streaming
pt_br: Transmissão

# #30066
source: Use inputstream.adaptive for m3u8 (HLS) streams
pt_br: Usar inputstream.adaptive para fluxos m3u8 (HLS)

# #30067
source: Use FFmpeg http reconnect options if possible
pt_br: Usar as opções de reconexão http do FFmpeg, se possível

# #30070
source: MIME type
pt_br: Tipo MIME

# #30071
source: Channel defaults
pt_br: Padrões de canal

# #30072
source: Number of Radio groups
pt_br: Número de grupos de rádio

# #30073
source: Custom Radio groups file
pt_br: Arquivo de grupos de rádios personalizados

# #30074
source: Only load Radio channels in groups
pt_br: Carregar apenas canais de rádio em grupos

# #30075
source: For local logos path ignore M3U logos
pt_br: Para o caminho de logotipos locais, ignore os logotipos M3U

# #30076
source: Groups
pt_br: Grupos

# #30077
source: Ignore Case for EPG Channel IDs
pt_br: Ignorar maiúsculas e minúsculas para IDs de canal EPG

# #30101
source: Enable catchup
pt_br: Ativar catchup

# #30102
source: Query format string
pt_br: Cadeia de formato da consulta

# #30103
source: Catchup window
pt_br: Janela de recuperação

# #30104
source: Channels support catchup using mode
pt_br: Os canais suportam o modo de uso catchup

# #30105
source: Watch From EPG
pt_br: Assistir a partir do EPG

# #30106
source: Play from EPG in Live TV mode (using timeshift)
pt_br: Reproduzir a partir do EPG no modo TV ao vivo (usando timeshift)

# #30107
source: Buffer before program start
pt_br: Buffer antes do início do programa

# #30108
source: Buffer after program end
pt_br: Buffer após o fim do programa

# #30109
source: Catchup only available on finished programmes
pt_br: Catchup disponível apenas em programas concluídos

# #30110
source: Disabled
pt_br: Desativado

# #30111
source: Default
pt_br: Normal

# #30112
source: Append
pt_br: Acrescentar

# #30114
source: Flussonic
pt_br: Flussônico

# #30116
source: Include channels
pt_br: Incluir canais

# #30117
source: without catchup mode
pt_br: sem o modo catchup

# #30118
source: with catchup mode
pt_br: com o modo catchup

# #30119
source: with and without catchup mode (all channels)
pt_br: com e sem modo catchup (todos os canais)

# #30121
source: Enable timeshift
pt_br: Ativar timeshift

# #30122
source: Enable timeshift for HTTP based streams
pt_br: Ativar timeshift para fluxos baseados em HTTP

# #30123
source: - Modify inputstream.ffmpegdirect settings...
pt_br: - Modificar as configurações do inputstream.ffmpegdirect...

# #30124
source: Inputstream Settings
pt_br: Inputstream

# #30125
source: Always enable timeshift stream mode if missing
pt_br: Sempre ative o modo de fluxo de timeshift se estiver faltando

# #30126
source: Enable timeshift for all streams
pt_br: Ativar timeshift para todos os fluxos

# #30127
source: Enable timeshift for UDP based streams
pt_br: Ativar timeshift para fluxos baseados em UDP

# #30128
source: Catchup correction
pt_br: Correção do catchup

# #30150
source: Media
pt_br: Mídia

# #30151
source: Group entries by title
pt_br: Agrupar registros por título

# #30152
source: Group entries by season
pt_br: Agrupar registros por temporada

# #30153
source: Include season and episode number in title
pt_br: Incluir número de temporada e episódio no título

# #30154
source: Include VODs as media
pt_br: Incluir VODs como mídia

# #30155
source: Show Media as recordings
pt_br: Mostrar mídia como gravações

# #30156
source: Use M3U Group name in path
pt_br: Usar o nome do grupo M3U no caminho

# #30157
source: Never
pt_br: Nunca

# #30158
source: Always append
pt_br: Sempre acrescentar

# #30159
source: When no media-dir is present
pt_br: Quando nenhum diretório de mídia estiver presente

# #30160
source: Force all M3U entries to be media
pt_br: Forçar todas as entradas M3U a serem de mídia

# #30451
source: Radio
pt_br: Rádio

# #30500
source: Inputstream error
pt_br: Erro no inputstream

# #30501
source: The %s addon is not installed.
pt_br: O addon %s não está instalado.

# #30502
source: The %s addon is not enabled.
pt_br: O addon %s não está ativado.

# #30600
source: General settings required for the addon to function.
pt_br: Ajustes gerais necessárias para o complemento funcionar.

# #30601
source: Select where to find the M3U resource. The options are: [B]Local path[/B] - A path to an M3U file whether it be on the device or the local network; [B]Remote path[/B] - A URL specifying the location of the M3U file.
pt_br: Selecione onde encontrar o recurso M3U. As opções são: [B]Caminho local[/B] - Um caminho para um arquivo M3U, seja no dispositivo ou na rede local; [B] Caminho remoto[/B] - UMA URL especificando o local do arquivo M3U.

# #30602
source: If location is [B]Local path[/B] this setting must contain a valid path for the addon to function.
pt_br: Se o local for [B]Caminho local[/B], essa configuração deverá conter um caminho válido para que o addon funcione.

# #30603
source: If location is [B]Remote path[/B] this setting must contain a valid URL for the addon to function.
pt_br: Se o local for [B]Caminho remoto[/B], essa configuração deverá conter uma URL válida para que o addon funcione.

# #30604
source: If location is [B]Remote path[/B] select whether or not the the M3U file should be cached locally.
pt_br: Se o local for [B]Caminho remoto[/B], selecione se o arquivo M3U deve ou não ser armazenado em cache localmente.

# #30605
source: The number to start numbering channels from. Only used when [B]Use backend channel numbers[/B] from PVR settings is enabled and a channel number is not supplied in the M3U file.
pt_br: O número a partir do qual iniciar a numeração de canais. Usado somente quando [B]Usar números de canal de back-end[/B] das configurações de PVR está habilitado e um número de canal não é fornecido no arquivo M3U.

# #30606
source: Ignore any 'tvg-chno' tags and only number channels by the order in the M3U starting at 'Start channel number'.
pt_br: Ignore as tags 'tvg-chno' e apenas os canais numéricos pela ordem no M3U, começando em 'Iniciar número do canal'.

# #30607
source: Select the auto refresh mode for the M3U/XMLTV files. Note that caching is disabled if auto refresh is used. The options are: [B]Disabled[/B] - Don't auto refresh the files; [B]Repeated refresh[/B] - Refresh the files on a minute based interval; [B]Once per day[/B] - Refresh the files once per day.
pt_br: Selecione o modo de atualização automática para os arquivos M3U/XMLTV. Observe que o armazenamento em cache será desativado se a atualização automática for usada. As opções são: [B]desativado[/B] - Não atualizar automaticamente os arquivos; [B]Atualização repetida[/B] - Atualizar os arquivos em um intervalo baseado em minutos; [B]Uma vez por dia[/B] - Atualizar os arquivos uma vez por dia.

# #30608
source: If M3U auto refresh mode is [B]Repeated refresh[/B] refresh the files every time this number of minutes passes. Max 120 minutes.
pt_br: Se o modo de atualização automática do M3U for [B]Atualização repetida[/B], atualize os arquivos sempre que esse número de minutos passar. Máximo de 120 minutos.

# #30609
source: If auto refresh mode is [B]Once per day[/B] refresh the files every time this hour of the day is reached.
pt_br: Se o modo de atualização automática for [B]Uma vez por dia[/B], atualize os arquivos sempre que essa hora do dia for atingida.

# #30610
source: Only TV channels that belong to groups (i.e. have a [B]group-title[/B] attribute) will be loaded from the M3U file.
pt_br: Somente os canais de TV que pertencem a grupos (ou seja, têm um atributo [B]grupo-título[/B]) serão carregados do arquivo M3U.

# #30611
source: Choose from one of the following three modes: [B]All groups[/B] Load all TV groups from the M3U file; [B]Some groups[/B] Only load the groups specified in the next options; [B]Custom groups[/B] Load a set of groups from the M3U file whose names are loaded from an XML file.
pt_br: Escolha um dos três modos a seguir: [B]Todos os grupos[/B] Carrega todos os grupos de TV do arquivo M3U; [B]Alguns grupos[/B] Carrega apenas os grupos especificados nas próximas opções; [B]Grupos personalizados[/B] Carrega um conjunto de grupos do arquivo M3U cujos nomes são carregados de um arquivo XML.

# #30612
source: If the previous option has been has been set to 'Some groups' you need to specify a TV group to be loaded from the M3U file. Please note that this is the group name as shown in the group-title attribute (i.e. 'UK (TV)'). This setting is case-sensitive.
pt_br: Se a opção anterior tiver sido definida como "Alguns grupos", você precisará especificar um grupo de TV a ser carregado do arquivo M3U. Observe que esse é o nome do grupo, conforme mostrado no atributo grupo-título (ou seja, "UK (TV)"). Essa configuração diferencia maiúsculas de minúsculas.

# #30613
source: Choose from one of the following three modes: [B]All groups[/B] Load all Radio groups from the M3U file[/B]; [B]Some groups[/B] Only load the groups specified in the next options; [B]Custom groups[/B] Load a set of groups from the M3U file whose names are loaded from an XML file.
pt_br: Escolha um dos três modos a seguir: [B]Todos os grupos[/B] Carrega todos os grupos de rádio do arquivo M3U[/B]; [B]Alguns grupos[/B] Carrega apenas os grupos especificados nas próximas opções; [B]Grupos personalizados[/B] Carrega um conjunto de grupos do arquivo M3U cujos nomes são carregados de um arquivo XML.

# #30614
source: If the previous option has been has been set to 'Some groups' you need to specify a Radio group to be fetched from the M3U file. Please not that this is the group name as shown on the group-title attribute (i.e. 'UK (Radio)'). This setting is case-sensitive.
pt_br: Se a opção anterior tiver sido definida como "Alguns grupos", você precisará especificar um grupo de rádio a ser obtido do arquivo M3U. Observe que esse é o nome do grupo, conforme mostrado no atributo grupo-título (ou seja, "UK (Radio)"). Essa configuração diferencia maiúsculas de minúsculas.

# #30615
source: The file used to load the custom TV groups. The default file is `customTVGroups-example.xml`.
pt_br: O arquivo usado para carregar os grupos de TV personalizados. O arquivo padrão é "customTVGroups-example.xml".

# #30616
source: The file used to load the custom Radio groups. The default file is `customRadioGroups-example.xml`.
pt_br: O arquivo usado para carregar os grupos de rádios personalizados. O arquivo padrão é "customRadioGroups-example.xml".

# #30617
source: The number of TV groups to load when `Some groups` is the selected mode. Up to 5 can be chosen. If more than 5 are required the 'Custom groups' mode should be used instead.
pt_br: O número de grupos de TV a serem carregados quando "Alguns grupos" for o modo selecionado. Podem ser escolhidos até 5. Se forem necessários mais de 5, o modo "Grupos personalizados" deverá ser usado.

# #30618
source: The number of Radio groups to load when `Some groups` is the selected mode. Up to 5 can be chosen. If more than 5 are required the 'Custom groups' mode should be used instead.
pt_br: O número de grupos de rádio a serem carregados quando "Alguns grupos" for o modo selecionado. Podem ser escolhidos até 5. Se forem necessários mais de 5, o modo "Grupos personalizados" deve ser usado.

# #30619
source: Only Radio channels that belong to groups (i.e. have a [B]group-title[/B] attribute) will be loaded from the M3U file.
pt_br: Somente os canais de rádio que pertencem a grupos (ou seja, têm um atributo [B]grupo-título[/B]) serão carregados do arquivo M3U.

# #30620
source: Settings related to the EPG. Note that Kodi will only load the EPG data when it needs to. The add-on will force a load of the EPG data regardless of whether or not Kodi requests it if either catchup is enabled or XMLTV logos are required.
pt_br: Configurações relacionadas ao EPG. Observe que a Kodi só carregará os dados do EPG quando for necessário. O addon forçará o carregamento dos dados do EPG, independentemente de o Kodi solicitá-lo ou não, se o catchup estiver ativado ou se os logotipos XMLTV forem necessários.

# #30621
source: Select where to find the XMLTV resource. The options are: [B]Local path[/B] - A path to an XMLTV file whether it be on the device or the local network; [B]Remote path[/B] - A URL specifying the location of the XMLTV file.
pt_br: Selecione onde localizar o recurso XMLTV. As opções são: [B]Caminho local[/B] - Um caminho para um arquivo XMLTV, esteja ele no dispositivo ou na rede local; [B]Caminho remoto[/B] - Uma URL especificando o local do arquivo XMLTV.

# #30622
source: If location is [B]Local Path[/B] this setting should contain a valid path.
pt_br: Se o local for [B]Caminho local[/B], essa configuração deverá conter um caminho válido.

# #30623
source: If location is [B]Remote Path[/B] this setting should contain a valid URL.
pt_br: Se o local for [B]Caminho remoto[/B], essa configuração deverá conter uma URL válida.

# #30624
source: If location is [B]Remote path[/B] select whether or not the the XMLTV file should be cached locally.
pt_br: Se o local for [B]Caminho remoto[/B], selecione se o arquivo XMLTV deve ou não ser armazenado em cache localmente.

# #30625
source: Adjust the EPG times by this value, from -12 hours to +14 hours.
pt_br: Ajuste os horários do EPG por esse valor, de -12 horas a +14 horas.

# #30626
source: Whether or not to override the time shift for all channels with `EPG time shift`. If not enabled `EPG time shift` plus the individual time shift per channel (if available) will be used.
pt_br: Substituir ou não a mudança de horário para todos os canais com `EPG time shift '. Se não estiver ativado, será utilizado o `EPG time shift 'mais o time shift individual por canal (se disponível).

# #30627
source: Ignore Case for EPG Channel IDs, also known as tvg-id's, when matching channels to EPG entries. If disabled, only case senitive matching will be used.
pt_br: Ignora maiúsculas e minúsculas para IDs de canal EPG, também conhecidas como tvg-id's, ao corresponder canais a registros EPG. Se desabilitada, somente a correspondência de senitiva de maiúsculas e minúsculas será usada.

# #30640
source: Settings related to Channel Logos.
pt_br: Ajustes relacionados aos logos do canais.

# #30641
source: Select where to find the channel logos. The options are: [B]Local path[/B] - A path to a folder whether it be on the device or the local network; [B]Remote path[/B] - A base URL specifying the location of the logos.
pt_br: Selecione onde encontrar os logotipos dos canais. As opções são: [B]Caminho local[/B] (Caminho local) - Um caminho para uma pasta, seja no dispositivo ou na rede local; [B]Caminho remoto[/B] (Caminho remoto) - Uma URL de base que especifica o local dos logotipos.

# #30642
source: If location is [B]Local Path[/B] this setting should contain a valid folder.
pt_br: Se o local for [B]Caminho local[/B], essa configuração deverá conter uma pasta válida.

# #30643
source: If location is [B]Remote Path[/B] this setting should contain a valid base URL.
pt_br: Se o local for [B]Caminho remoto[/B], essa configuração deverá conter uma URL de base válida.

# #30644
source: Preference on how to handle channel logos. The options are: [B]Ignore[/B] - Don't use channel logos from an XMLTV file; [B]Prefer M3U[/B] - Use the channel logo from the M3U if available otherwise use the XMLTV logo; [B]Prefer XMLTV[/B] - Use the channel logo from the XMLTV file if available otherwise use the M3U logo.
pt_br: Preferência sobre como lidar com os logotipos do canal. As opções são: [B]Ignorar[/B] - Não usa logotipos de canais de um arquivo XMLTV; [B]Preferir M3U[/B] - Usa o logotipo do canal do M3U, se disponível; caso contrário, usa o logotipo do XMLTV; [B]Preferir XMLTV[/B] - Usa o logotipo do canal do arquivo XMLTV, se disponível; caso contrário, usa o logotipo do M3U.

# #30645
source: If a local path is selected for logos ignore any logos from the M3U file.
pt_br: Se um caminho local for selecionado para os logotipos, ignore todos os logotipos do arquivo M3U.

# #30660
source: Settings related to genres.
pt_br: Ajustes relacionados a gêneros.

# #30661
source: If enabled, and a genre mapping file is used to get a genre type and sub type use the EPG's genre text (i.e. 'category' text) for the genre instead of the kodi default text.
pt_br: Se ativado, e um arquivo de mapeamento de gênero for usado para obter um tipo e subtipo de gênero, use o texto de gênero do EPG (ou seja, texto de 'categoria') para o gênero, em vez do texto padrão do kodi.

# #30662
source: Select where to find the genres XML resource. The options are: [B]Local path[/B] - A path to a genres XML file whether it be on the device or the local network; [B]Remote path[/B] - A URL specifying the location of the genres XML file.
pt_br: Selecione onde encontrar o recurso XML de gêneros. As opções são: [B]Caminho local[/B] - Um caminho para um arquivo XML de gêneros, seja no dispositivo ou na rede local; [B]Caminho remoto[/B] - Uma URL que especifica o local do arquivo XML de gêneros.

# #30663
source: If location is [B]Local Path[/B] this setting should contain a valid path.
pt_br: Se o local for [B]Caminho local[/B], essa configuração deverá conter um caminho válido.

# #30664
source: If location is [B]Remote Path[/B] this setting should contain a valid URL.
pt_br: Se o local for [B]Caminho remoto[/B], essa configuração deverá conter uma URL válida.

# #30680
source: Advanced settings including multicast relays, streaming properties etc.
pt_br: Configurações avançadas, incluindo retransmissões multicast, propriedades de streaming etc.

# #30681
source: Multicast (UDP/RTP) streams do not work well on Wifi networks. A multicast relay can convert the stream from UDP/RTP multicast to HTTP. Enabling this option will transform multicast stream URLs from the M3U file to HTTP addresses so they can be accesssed via a 'udpxy' relay on the local network. E.g. a UDP multicast stream URL like 'udp://@239.239.3.38:5239' would get transformed to something like 'http://192.168.1.1:4000/udp/239.239.3.38:5239'.
pt_br: Os fluxos de difusão seletiva (UDP / RTP) não funcionam bem em redes Wi-Fi. Um relé multicast pode converter o fluxo de multicast UDP / RTP para HTTP. A ativação dessa opção transformará os URLs de fluxo multicast do arquivo M3U em endereços HTTP, para que possam ser acessados por meio de um relé 'udpxy' na rede local. Por exemplo. um URL de fluxo UDP multicast como 'udp: //@239.239.3.38: 5239' seria transformado em algo como 'http://192.168.1.1:4000/udp/239.239.3.38:5239'.
