Repository: kodi-pvr/pvr.iptvsimple
Catalog: pvr.iptvsimple/resources/language/resource.language.*/strings.po
Languages: pt_br, zh_tw

# #30682
source: The hostname or ip address of the multicast relay (udpxy) on the local network.
pt_br: O nome do host ou o endereço IP do relé multicast (udpxy) na rede local.

# #30683
source: The port of the multicast relay (udpxy) on the local network.
pt_br: A porta do relé multicast (udpxy) na rede local.

# #30684
source: Use inputstream.adaptive instead of ffmpeg's libavformat for m3u8 (HLS) streams.
pt_br: Usar inputstream.adaptive em vez do libavformat do ffmpeg para fluxos m3u8 (HLS).

# #30685
source: Note this can only apply to http/https streams that are processed by libavformat (e.g. M3u8/HLS). Using libavformat can be specified in an M3U file by setting the property `inputstream` as `inputstream.ffmpeg` for kodi's internal implementation or `inputstream.ffmpegdirect` for addon version. I.e. adding the line: `#KODIPROP:inputstream=inputstream.ffmpeg`. If this option is not enabled it can still be enabled per stream/channel by adding a kodi property, i.e.: `#KODIPROP:http-reconnect=true`.
pt_br: Observe que isso só se aplica a fluxos http/https que são processados pelo libavformat (por exemplo, M3u8/HLS). O uso do libavformat pode ser especificado em um arquivo M3U, definindo a propriedade "inputstream" como "inputstream.ffmpeg" para a implementação interna do kodi ou "inputstream.ffmpegdirect" para a versão addon. Ou seja, adicionando a linha: "#KODIPROP:inputstream=inputstream.ffmpeg". Se essa opção não estiver ativada, ela ainda poderá ser ativada por fluxo/canal adicionando uma propriedade do kodi, ou seja: "#KODIPROP:http-reconnect=true".

# #30686
source: Use this User-Agent if there is not one supplied as a property or as part of the channel stream URL.
pt_br: Use esse User-Agent se não houver um fornecido como uma propriedade ou como parte da URL do fluxo do canal.

# #30687
source: Use this inputsream as the default if there is not one supplied as a property (KODIPROP) of the channel. Use with care as this will disable any use of the addon's default stream inspection behaviour. Note that for `inputstream.ffmpegdirect` if both `mimetype` and `inputstream.ffmpegdirect.manifest_type` are unset stream inspection will still occur if required.
pt_br: Use esse inputsream como padrão se não houver um fornecido como uma propriedade (KODIPROP) do canal. Use com cuidado, pois isso desabilitará qualquer uso do comportamento de inspeção de fluxo padrão do addon. Observe que para "inputstream.ffmpegdirect" se ambos "mimetype" e "inputstream.ffmpegdirect.manifest_type" estiverem desconfigurados, a inspeção de fluxo ainda ocorrerá, se necessário.

# #30688
source: Use this MIME type as the default if there is not one supplied as a property (KODIPROP) of the channel. Use with care as this will disable any use of the addon's default stream inspection behaviour.
pt_br: Use esse tipo de MIME como padrão se não houver um fornecido como uma propriedade (KODIPROP) do canal. Use com cuidado, pois isso desativará qualquer uso do comportamento de inspeção de fluxo padrão do addon.

# #30700
source: Catchup settings for viewing archived live programmes. Allows the option of 'Play programme' when viewing EPG entry info.
pt_br: Configurações do Catchup para visualização de programas ao vivo arquivados. Permite a opção de "Reproduzir programa" ao visualizar informações de entrada do EPG.

# #30701
source: Should be enabled if there are channels supporting catchup in your M3U list.
pt_br: Deve ser ativado se houver canais que suportem catchup em sua lista M3U.

# #30702
source: A query format string (provider dependent) allowing timestamp information to be appended to a URL to denote when to catchup from. E.g. `&cutv={Y}-{m}-{d}T{H}:{M}:{S}`, which allows year, month, day, hour minute and second to be inserted to give: `&cutv=2019-11-26T22:00:32`. If the M3U entry using has a catchup mode of 'default' or 'append' and a 'catchup-source' tag is provided in the M3U entry this setting will be ignored.
pt_br: Uma cadeia de caracteres de formato de consulta (dependente do provedor) que permite que informações de registro de data e hora sejam anexadas a um URL para indicar quando a recuperação deve ser feita. Por exemplo, "&cutv={Y}-{m}-{d}T{H}:{M}:{S}", que permite que o ano, o mês, o dia, a hora, o minuto e o segundo sejam inseridos para fornecer: "&cutv=2019-11-26T22:00:32". Se a entrada M3U que estiver sendo usada tiver um modo de catchup "padrão" ou "acrescentar" e uma tag "catchup-source" for fornecida na entrada M3U, essa configuração será ignorada.

# #30703
source: A number of days into the past in which it is possible to catchup on a programme. Can be overidden in an M3U entry using a 'catchup-days' tag.
pt_br: Um número de alguns dias atrás em que é possível assistir a um programa. Pode ser substituído em uma entrada M3U usando uma tag "catchup-days".

# #30706
source: The amount of buffer to give before the playback start point of an EPG entry that will be watched as a video.
pt_br: A quantidade de buffer a ser fornecida antes do ponto de início da reprodução de uma entrada de EPG que será assistida como um vídeo.

# #30707
source: The amount of buffer to give after the playback end point of an EPG entry that will be watched as a video.
pt_br: A quantidade de buffer a ser fornecida após o ponto final de reprodução de uma entrada de EPG que será assistida como um vídeo.

# #30708
source: When selected from the EPG the current live programme cannot be watched as catchup until finished.
pt_br: Quando selecionado no EPG, o programa ao vivo atual não pode ser assistido como catchup até que seja concluído.

# #30710
source: Adjust the time used for catchup stream URL generation by this value, from -12 hours to +14 hours. Useful for catchup streams which are geo mis-matched to the wrong time. Note that this value can be overridden by values in the M3U file.
pt_br: Ajuste o horário usado para a geração de URL de fluxo de catchup por esse valor, de -12 horas a +14 horas. Útil para transmissões de catchup com correspondência geográfica incorreta para a hora errada. Observe que esse valor pode ser substituído por valores no arquivo M3U.

# #30720
source: Timeshift settings for pausing/rewinding and fast-forwarding live streams.
pt_br: Configurações de Timeshift para pausar/retroceder e avançar rapidamente as transmissões ao vivo.

# #30721
source: Enable the timeshift feature.
pt_br: Ativa o recurso de timeshift.

# #30722
source: Enable the timeshift feature for HTTP based streams. Will only apply to streams that do not select a specific inputstream addon for playback. . The inputstream.ffmpegdirect addon will be used for timeshift.
pt_br: Ativa o recurso de timeshift para fluxos baseados em HTTP. Será aplicado somente a transmissões que não selecionam um addon de fluxo de entrada específico para reprodução. O addon inputstream.ffmpegdirect será usado para o timeshift.

# #30723
source: Open settings dialog for inputstream.ffmpegdirect for modification of timeshift and other settings.
pt_br: Abra a caixa de diálogo de configurações do inputstream.ffmpegdirect para modificar o timeshift e outras configurações.

# #30724
source: If a stream_mode property is not specified along with an inputstream.ffmpegdirect property always add it for any supported stream types. Note that this setting has no effect on catchup VOD streams that are not live.
pt_br: Se uma propriedade stream_mode não for especificada junto com uma propriedade inputstream.ffmpegdirect, sempre a adicione para qualquer tipo de fluxo compatível. Observe que essa configuração não tem efeito sobre fluxos VOD catchup que não sejam ao vivo.

# #30725
source: Enable the timeshift feature for all streams. Will only apply to streams that do not select a specific inputstream addon for playback. The inputstream.ffmpegdirect addon will be used for timeshift.
pt_br: Ativa o recurso de timeshift para todos os fluxos. Será aplicado somente a transmissões que não selecionam um addon de fluxo de entrada específica para reprodução. O addon inputstream.ffmpegdirect será usado para o timeshift.

# #30726
source: Enable the timeshift feature for UDP based streams. Will only apply to streams that do not select a specific inputstream addon for playback. The inputstream.ffmpegdirect addon will be used for timeshift.
pt_br: Ativa o recurso de timeshift para fluxos baseados em UDP. Será aplicado somente a transmissões que não selecionam um addon de fluxo de entrada específica para reprodução. O addon inputstream.ffmpegdirect será usado para o timeshift.

# #30740
source: If provided this value will be used as the provider name if one was not provided in the M3U. It can be used in combination with the provider mapping file which can supply type, icon path, country and language fields.
pt_br: Se fornecido, esse valor será usado como o nome do provedor, caso não tenha sido fornecido um no M3U. Ele pode ser usado em combinação com o arquivo de mapeamento do provedor, que pode fornecer campos de tipo, caminho do ícone, país e idioma.

# #30741
source: If enabled any provider name read from the M3U or the default provider name will be used to read further metadata from the mapping file. The metadata includes custom name, type, icon path, country and language.
pt_br: Se ativado, qualquer nome de provedor lido do M3U ou o nome de provedor padrão será usado para ler outros metadados do arquivo de mapeamento. Os metadados incluem nome personalizado, tipo, caminho do ícone, país e idioma.

# #30742
source: The config file to map provider names received from the M3U or the default provider name to custom name, icons etc. The default file is [I]providerMappings.xml[/I].
pt_br: O arquivo de configuração para mapear os nomes de provedores recebidos do M3U ou o nome padrão do provedor para nomes personalizados, ícones etc. O arquivo padrão é [I]providerMappings.xml[/I].

# #30743
source: Settings on customising channel groups.
pt_br: Configurações sobre a personalização de grupos de canais.

# #30800
source: Settings related to VOD media.
pt_br: Configurações relacionadas à mídia VOD.

# #30801
source: If multiple entries exist with matching titles create a virtual folder to group them together.
pt_br: Se houver várias entradas com títulos correspondentes, crie uma pasta virtual para agrupá-las.

# #30802
source: If multiple entries exist with matching titles create a second virtual folder to group them together by season also if possible.
pt_br: Se houver várias entradas com títulos correspondentes, crie uma segunda pasta virtual para agrupá-las por temporada também, se possível.

# #30803
source: Prepend the season and episode numbers to the title.
pt_br: Acrescenta os números da temporada e do episódio ao título.

# #30804
source: Show VOD as recordings if enabled. If disabled only M3U entries with media attributes will be shown as recordings.
pt_br: Mostra VOD como gravações, se ativado. Se estiver desativado, somente as entradas M3U com atributos de mídia serão mostradas como gravações.

# #30805
source: If enabled, all IPTV media entries can be shown as PVR recordings. Otherwise, they appear as regular PVR channels.
pt_br: Se ativado, todas as entradas de mídia IPTV podem ser mostradas como gravações PVR. Caso contrário, elas aparecerão como canais PVR normais.

# #30806
source: Select how to use the M3U group title in the path. Note that it will only be used if a single group name is provided. The options are: [B]Never[/B] - Never use it; [B]Always append[/B] - Always append it; [B]When no media-dir is present[/B] - Only use the group title of the M3U when no media-dir is provided.
pt_br: Selecione como usar o título do grupo M3U no caminho. Observe que ele só será usado se for fornecido um único nome de grupo. As opções são: [B] Nunca [/B] - Nunca use; [B]Sempre acrescentar[/B] - Sempre acrescenta; [B]Quando nenhum diretório de mídia estiver presente[/B] - Usa apenas o título do grupo do M3U quando nenhum diretório de mídia for fornecido.

# #30806
source: Force the full playlist to be media, regardless of what tags are present. Since the introduction of multiple instances for PVR add-ons this option can be useful.
pt_br: Força a lista de reprodução completa a ser mídia, independentemente de quais tags estejam presentes. Desde a introdução de várias instâncias para addons de PVR, essa opção pode ser útil.

# #30001
source: Local Path (include Local Network)
zh_tw: 本地位置 (包括內聯網路)

# #30002
source: Remote Path (Internet address)
zh_tw: 遠端位置 (互聯網網址)

# #30011
source: M3U Play List Path
zh_tw: M3U 播放表位置

# #30012
source: M3U Play List URL
zh_tw: M3U 播放表網址

# #30013
source: Numbering channels starts at
zh_tw: 頻道編號始初號碼

# #30020
source: EPG Settings
zh_tw: 電子節目表設定

# #30021
source: XMLTV Path
zh_tw: XMLTV 位置

# #30023
source: Apply Time Shift To All Channels
zh_tw: 套用時區修正至所有頻道

# #30024
source: EPG Time Shift (hours)
zh_tw: 電子節目時間線偏移 (小時)

# #30030
source: Channels Logos
zh_tw: 頻道台標

# #30031
source: Channels Logos Folder
zh_tw: 台標資料夾

# #30032
source: Channels Logos Base URL
zh_tw: 台標資料庫網址

# #30041
source: Channels Logos from XMLTV
zh_tw: 從 XMLTV 檔提取台標
